InformationRegisters/ns_APNsСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ns_APNsСертификаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_APNsВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ns_APNsСертификаты/Ext/ManagerModule.bsl
Функция ПолучитьСертификатAPNs(ВидСертификата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_APNsСертификаты.Сертификат КАК Сертификат
	|ИЗ
	|	РегистрСведений.ns_APNsСертификаты КАК ns_APNsСертификаты
	|ГДЕ
	|	ns_APNsСертификаты.ВидСертификата = &ВидСертификата";
	Запрос.УстановитьПараметр("ВидСертификата", ВидСертификата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Сертификат.Получить();
КонецФункции
